<template>
    <FooterDefault class="info-container">
        <div class="row">
            <div class="col-3"></div>
            <div class="col-8 flex justify-center header">Описание</div>
        </div>
        <div class="row h-inherit">
            <q-tabs
                class="col-3"
                vertical
                @update:model-value="selectFilm"
            >
                <q-tab
                    v-for="film in films"
                    :key="film.name"
                    v-bind="film"
                    class="info-film-tab"
                    :class="{ active: film.name === activeFilm }"
                />
            </q-tabs>
            <template
                v-for="film in films"
                :key="film.name"
            >
                <div
                    v-if="film.name === activeFilm"
                    class="info-table col-9"
                >
                    <div class="row">
                        <div class="col-6">{{ film.info.name }}</div>
                        <div class="col-6">{{ film.info.year }}</div>
                    </div>
                    <div class="row">
                        <div class="col-6">Перевод: {{ film.info.language }}</div>
                        <div class="col-6">Качество: {{ film.info.quality }}</div>
                    </div>
                    <div class="row">
                        <div class="col-6">Страна: {{ film.info.country }}</div>
                        <div class="col-6">{{ film.info.director }}</div>
                    </div>
                    <div class="row">
                        {{ film.info.actors }}
                    </div>
                    <div class="row">
                        {{ film.info.info }}
                    </div>
                </div>
            </template>
        </div>
        <BackToMain/>
    </FooterDefault>
</template>

<script>
import FooterDefault from '../components/FooterDefault.vue';
import BackToMain from '../components/BackToMain.vue';

export default {
    components: { BackToMain, FooterDefault },
    data() {
        return {
            activeFilm: 'Гарри Поттер и Философский камень',
            films:      [
                {
                    name:  'Гарри Поттер и Философский камень',
                    label: 'Гарри Поттер и Философский камень',
                    info:  {
                        name:     'Название: Harry Potter and the Sorcerer\'s Stone',
                        year:     'Год: 2001',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Крис Коламбус',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Ричард Харрис, Алан Рикман, Мэгги Смит, Робби Колтрейн, Том Фелтон, Мэттью Льюис, Иэн Харт',
                        info:     'Гарри – 11-летний мальчик, живет в семье родственников в провинциальном английском городке. Опекуны относятся к герою как к чужому ребенку, не уделяя ему необходимого внимания. Герой празднует день рождения, узнает, что родители, которые погибли в автоаварии, были волшебниками. Гарри, как наследника, зачисляют в школу в Хогвартсе, готовящей чародеев и волшебников. Приезжает за мальчиком Хагрид – привлекательный великан. Он знакомит Поттера с миром магии, садит на специальный поезд, следующий в школу. Там героя ждут знакомства с Гермионой, Роном, которые становятся в будущем друзьями. Узнает, что в гибели родителей виновен злодей де-Морт, мечтающий обзавестись жизненным эликсиром, чтобы вновь стать живым…',
                    },
                },
                {
                    name:  'Гарри Поттер и Тайная комната',
                    label: 'Гарри Поттер и Тайная комната',
                    info:  {
                        name:     'Название: Harry Potter and the Chamber of Secrets',
                        year:     'Год: 2002',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Крис Коламбус',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Том Фелтон, Кеннет Брана, Бонни Райт, Алан Рикман, Ричард Харрис, Мэгги Смит, Робби Колтрейн',
                        info:     'Герой проводит летние каникулы у опекунов. Перед началом учебы мальчик получает от Добби – эльфа в доме – предупреждение об ожидающих того неприятностях на пути в школу. Гарри не соглашается остаться… Дом жестоких родственников герой покидает благодаря братьям Уизли, которые навестили парня, пользуясь летающим автомобилем. На вокзале Поттер встречается с Роном; друзья не могут открыть вокзальный портал, потому приходится добираться до школы, вызвав волшебную машину… В Хогвартсе происходит ужасное – ученики превращаются в камни. В их числе Гермиона – подружка Гарри, младшекурсник Колин. Дамблдор высказывает опасение, что это дело рук жестокого чудовища, томящегося в потайном помещении замка…',
                    },
                },
                {
                    name:  'Гарри Поттер и узник Азкабана',
                    label: 'Гарри Поттер и узник Азкабана',
                    info:  {
                        name:     'Название: Harry Potter and the Prisoner of Azkaban',
                        year:     'Год: 2004',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Альфонсо Куарон',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Дэвид Тьюлис, Робби Колтрейн, Гари Олдман, Майкл Гэмбон, Алан Рикман, Том Фелтон, Тимоти Сполл',
                        info:     'Во время ссоры с родственниками герой случайно отправляет опекуншу летать над просторами Англии. Уходит, добирается до Косого переулка автобусом «Ночной рыцарь», обслуживающим волшебников, попавших в беду… В разговоре с министром магии герой получает информацию о побеге из заклчюения Сириуса Блэка – волшебника, из-за предательства которого погибли родители. Преступник намерен расправиться с ним. Школу от проникновения Сириуса Блэка защищают, разместив по периметру дементоров – жутких стражей, способных оставить жертву без надежды. Блэк, как становится известным, дружил с отцом Поттера. В школе работает профессор Люпин, который тоже был вхож в дом родителей…',
                    },
                },
                {
                    name:  'Гарри Поттер и Кубок огня',
                    label: 'Гарри Поттер и Кубок огня',
                    info:  {
                        name:     'Название: Harry Potter and the Goblet of Fire',
                        year:     'Год: 2005',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Майк Ньюэлл',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Брендан Глисон, Алан Рикман, Майкл Гэмбон, Рэйф Файнс, Роберт Паттинсон, Робби Колтрейн, Мэгги Смит',
                        info:     'Школа возбуждена предстоящим Турниром Трех Волшебников, в котором по традиции участвуют представители французских, российских школ магии. Хогвартс доверила место в состязании старшекурснику Седрику; Дурмстран – воину Виктору; Шармбатон – красавице Флер. Гарри, которому не прожил 16-летие, по правилам Турнира к соревнованию не допускается. Но его выдает Кубок и парню приходится вступить в борьбу с соперниками. В первом испытании он, управляя искусно метлой, обманывает злого дракона, выкрадывает яйцо-подсказку. Далее спасает друзей, похищенных русалкой, оказывается на кладбище вместе с Седриком из-за ловушки в лабиринте…',
                    },
                },
                {
                    name:  'Гарри Поттер и Орден Феникса',
                    label: 'Гарри Поттер и Орден Феникса',
                    info:  {
                        name:     'Название: Harry Potter and the Order of the Phoenix',
                        year:     'Год: 2001',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Дэвид Йейтс',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Гари Олдман, Рэйф Файнс, Майкл Гэмбон, Том Фелтон, Имелда Стонтон, Эванна Линч, Алан Рикман',
                        info:     'При поддержке Дамблдора герой сообщает окружающим об исчезновении де-Морта из темницы – в ответ парень слышит неверие, насмешки. Фадж – занимает пост министра магии – подозревает, что историю сочинил директор школы, давно желающий занять его место. По заданию чиновника в учебное заведение направляется Долорес Амбридж – профессор – для преподавания защиты от темных искусств. Женщина пренебрегает обязанностями, терроризирует учеников. Поттер в ответ из друзей тайно создает «Отряд Дамблдора», обучает заклятиям… К герою во время ночного отдыха приходят сны-предсказания. В одном Волан расправляется с крестным Сириусом – парень решает предотвратить убийство…',
                    },
                },
                {
                    name:  'Гарри Поттер и Принц-полукровка',
                    label: 'Гарри Поттер и Принц-полукровка',
                    info:  {
                        name:     'Название: Harry Potter and the Half-Blood Prince',
                        year:     'Год: 2009',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Дэвид Йейтс',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Майкл Гэмбон, Джим Бродбент, Бонни Райт, Хелена Бонем Картер, Алан Рикман, Том Фелтон, Эванна Линч',
                        info:     'Дамблдор телепортируется с героем из метрополитена Лондона к профессору Северусу Снеггу, чтобы уговорить того заняться преподаванием зельеварения в школе. Присутствуя на уроках, герой находит на полке шкафа учебник, замечает на страницах пометки. Знакомится заочно с «Принцем-полукровкой», которому принадлежала книга. Его записи оказываются полезными для мальчика – он получает статус лучшего на курсе, выигрывает первое место… По просьбе Дамблдора Поттер ищет воспоминание Северуса Снегга, способное справиться с Волан-де-Мортом. Но у профессора страх перед злодеем, Северус отказывается от сотрудничества…',
                    },
                },
                {
                    name:  'Гарри Поттер и Дары смерти. Часть 1',
                    label: 'Гарри Поттер и Дары смерти. Часть 1',
                    info:  {
                        name:     'Название: Harry Potter and the Deathly Hallows: Part 1',
                        year:     'Год: 2010',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Дэвид Йейтс',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Том Фелтон, Бонни Райт, Алан Рикман, Рэйф Файнс, Хелена Бонем Картер, Майкл Гэмбон, Брендан Глисон',
                        info:     'Чтобы не погибнуть от рук людей де-Морта, захвативших Министрество магии, Гарри с друзьями тайно покидают свадебное торжество, пытается отыскать крестражей. Ребята прячутся от преследующих Пожирателей смерти в старинном здании. Знакомятся с содержимым шкафов, столов, пользуются найденными подсказками для поиска кулона. Для уничтожения крестражей нужен меч… Волан в поисках Даров Смерти, с помощью которых надеется обрести новую жизнь, усилить могущество… Герои пленены Пожирателями смерти; им помогает сбежать из коттеджа эльф Добби.',
                    },
                },
                {
                    name:  'Гарри Поттер и Дары смерти. Часть 2',
                    label: 'Гарри Поттер и Дары смерти. Часть 2',
                    info:  {
                        name:     'Название: Harry Potter and the Deathly Hallows - Part 2',
                        year:     'Год: 2011',
                        language: 'Дубляж (Многоголосый)',
                        quality:  '1080p (FullHD)',
                        country:  'Великобритания, США',
                        director: 'Режиссер: Дэвид Йейтс',
                        type:     'Фэнтези, Приключения, Семейный',
                        actors:   'Актеры: Дэниэл Рэдклифф, Руперт Гринт, Эмма Уотсон, Хелена Бонем Картер, Робби Колтрейн, Уорвик Дэвис, Рэйф Файнс, Майкл Гэмбон, Джон Хёрт, Джейсон Айзекс',
                        info:     'Гоблин вначале помогает друзьям проникнуть в банк, чтобы забрать из ячейки, арендованной Беллатрисой, чашу Пуффендуй – очередной трофей, необходимый для победы над крестражами Волана. Но обманывает, прихватив оставленный ему на время меч Гриффиндора. В итоге ребята используют дракона, чтобы вовремя сбежать из банковского офиса. Гарри с товарищами снова в школе, где находят последний крестраж. В расправе с ним участвуют бывшие соученики, ведущие жестокую, беспощадную борьбу с подчиненными де-Морта. Хогвартс захватывают Пожиратели смерти, подчиняющиеся Темному лорду, требуют выдачи Поттера. Получают отказ от школьников, учителей…',
                    },
                },
            ],
        };
    },
    methods: {
        selectFilm(name) {
            this.activeFilm = name;
            console.log(name);
        },
    },
};
</script>